zhaozhi0810/stm32f407_embitz/ucos-20190121-lib/bsp/src/BSP_Uart.c
/*
********************************************************************************
*
*                                 BSP_Uart.c
*
* File          : BSP_Uart.c
* Version       : V1.0
* Author        : whq
* Mode          : Thumb2
* Toolchain     :
* Description   : 串口驱动程序
*
* History       :
* Date          : 2013.08.12
*******************************************************************************/
#include <string.h>

#include "misc.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_usart.h"
#include "stm32f4xx_dma.h"


#include "Queue.h"
#include "BSP_Uart.h"


//20190126
static uint8_t TX_BUFF[BSP_COM1_Tx_BUFF_SIZE] = {0};    //发送缓存，printf打印的数据写入该缓存
static QUEUE8_TYPE TX_QUEUE = {0};

#if COM1_EN
static uint8_t COM1_TX_BUFF[BSP_COM1_Tx_BUFF_SIZE] = {0};
static uint8_t COM1_RX_BUFF[BSP_COM1_Rx_BUFF_SIZE] = {0};
static QUEUE8_TYPE COM1_RX_QUEUE = {0};
#endif

#if COM2_EN
static uint8_t COM2_TX_BUFF[BSP_COM2_Tx_BUFF_SIZE] = {0};
static uint8_t COM2_RX_BUFF[BSP_COM2_Rx_BUFF_SIZE] = {0};
static QUEUE8_TYPE COM2_RX_QUEUE = {0};
#endif

#if COM3_EN
static uint8_t COM3_TX_BUFF[BSP_COM3_Tx_BUFF_SIZE] = {0};
static uint8_t COM3_RX_BUFF[BSP_COM3_Rx_BUFF_SIZE] = {0};
static QUEUE8_TYPE COM3_RX_QUEUE = {0};
#endif

#if COM4_EN
static uint8_t COM4_TX_BUFF[BSP_COM4_Tx_BUFF_SIZE] = {0};
static uint8_t COM4_RX_BUFF[BSP_COM4_Rx_BUFF_SIZE] = {0};
static QUEUE8_TYPE COM4_RX_QUEUE = {0};
#endif

#if COM5_EN
static uint8_t COM5_TX_BUFF[BSP_COM5_Tx_BUFF_SIZE] = {0};
static uint8_t COM5_RX_BUFF[BSP_COM5_Rx_BUFF_SIZE] = {0};
static QUEUE8_TYPE COM5_RX_QUEUE = {0};
#endif

#if COM6_EN
static uint8_t COM6_TX_BUFF[BSP_COM6_Tx_BUFF_SIZE] = {0};
static uint8_t COM6_RX_BUFF[BSP_COM6_Rx_BUFF_SIZE] = {0};
static QUEUE8_TYPE COM6_RX_QUEUE = {0};
#endif

#if COM7_EN
static uint8_t COM7_TX_BUFF[BSP_COM7_Tx_BUFF_SIZE] = {0};
static uint8_t COM7_RX_BUFF[BSP_COM7_Rx_BUFF_SIZE] = {0};
static QUEUE8_TYPE COM7_RX_QUEUE = {0};
#endif

#if COM8_EN
static uint8_t COM8_TX_BUFF[BSP_COM8_Tx_BUFF_SIZE] = {0};
static uint8_t COM8_RX_BUFF[BSP_COM8_Rx_BUFF_SIZE] = {0};
static QUEUE8_TYPE COM8_RX_QUEUE = {0};
#endif



static USART_TypeDef* const COM_USART[COMn] = {
#if     COM1_EN
    BSP_COM1,
#endif
#if     COM2_EN
    BSP_COM2,
#endif
#if     COM3_EN
    BSP_COM3,
#endif
#if     COM4_EN
    BSP_COM4,
#endif
#if     COM5_EN
    BSP_COM5,
#endif
#if     COM6_EN
    BSP_COM6,
#endif
#if     COM7_EN
    BSP_COM7,
#endif
#if     COM8_EN
    BSP_COM8,
#endif
};

static const uint8_t COM_AF[COMn] = {
#if     COM1_EN
    BSP_COM1_AF,
#endif
#if     COM2_EN
    BSP_COM2_AF,
#endif
#if     COM3_EN
    BSP_COM3_AF,
#endif
#if     COM4_EN
    BSP_COM4_AF,
#endif
#if     COM5_EN
    BSP_COM5_AF,
#endif
#if     COM6_EN
    BSP_COM6_AF,
#endif
#if     COM7_EN
    BSP_COM7_AF,
#endif
#if     COM8_EN
    BSP_COM8_AF,
#endif
};

static const uint8_t COM_TX_AF_PIN[COMn] = {
#if     COM1_EN
    BSP_COM1_TX_AF_PIN,
#endif
#if     COM2_EN
    BSP_COM2_TX_AF_PIN,
#endif
#if     COM3_EN
    BSP_COM3_TX_AF_PIN,
#endif
#if     COM4_EN
    BSP_COM4_TX_AF_PIN,
#endif
#if     COM5_EN
    BSP_COM5_TX_AF_PIN,
#endif
#if     COM6_EN
    BSP_COM6_TX_AF_PIN,
#endif
#if     COM7_EN
    BSP_COM7_TX_AF_PIN,
#endif
#if     COM8_EN
    BSP_COM8_TX_AF_PIN,
#endif
};

static const uint8_t COM_RX_AF_PIN[COMn] = {
#if     COM1_EN
    BSP_COM1_RX_AF_PIN,
#endif
#if     COM2_EN
    BSP_COM2_RX_AF_PIN,
#endif
#if     COM3_EN
    BSP_COM3_RX_AF_PIN,
#endif
#if     COM4_EN
    BSP_COM4_RX_AF_PIN,
#endif
#if     COM5_EN
    BSP_COM5_RX_AF_PIN,
#endif
#if     COM6_EN
    BSP_COM6_RX_AF_PIN,
#endif
#if     COM7_EN
    BSP_COM7_RX_AF_PIN,
#endif
#if     COM8_EN
    BSP_COM8_RX_AF_PIN,
#endif
};

static GPIO_TypeDef* const COM_TX_PORT[COMn] = {
#if     COM1_EN
    BSP_COM1_TX_GPIO_PORT,
#endif
#if     COM2_EN
    BSP_COM2_TX_GPIO_PORT,
#endif
#if     COM3_EN
    BSP_COM3_TX_GPIO_PORT,
#endif
#if     COM4_EN
    BSP_COM4_TX_GPIO_PORT,
#endif
#if     COM5_EN
    BSP_COM5_TX_GPIO_PORT,
#endif
#if     COM6_EN
    BSP_COM6_TX_GPIO_PORT,
#endif
#if     COM7_EN
    BSP_COM7_TX_GPIO_PORT,
#endif
#if     COM8_EN
    BSP_COM8_TX_GPIO_PORT,
#endif
};

static GPIO_TypeDef* const COM_RX_PORT[COMn] = {
#if     COM1_EN
    BSP_COM1_RX_GPIO_PORT,
#endif
#if     COM2_EN
    BSP_COM2_RX_GPIO_PORT,
#endif
#if     COM3_EN
    BSP_COM3_RX_GPIO_PORT,
#endif
#if     COM4_EN
    BSP_COM4_RX_GPIO_PORT,
#endif
#if     COM5_EN
    BSP_COM5_RX_GPIO_PORT,
#endif
#if     COM6_EN
    BSP_COM6_RX_GPIO_PORT,
#endif
#if     COM7_EN
    BSP_COM7_RX_GPIO_PORT,
#endif
#if     COM8_EN
    BSP_COM8_RX_GPIO_PORT,
#endif
};

static const uint32_t COM_USART_CLK[COMn] = {
#if     COM1_EN
    BSP_COM1_CLK,
#endif
#if     COM2_EN
    BSP_COM2_CLK,
#endif
#if     COM3_EN
    BSP_COM3_CLK,
#endif
#if     COM4_EN
    BSP_COM4_CLK,
#endif
#if     COM5_EN
    BSP_COM5_CLK,
#endif
#if     COM6_EN
    BSP_COM6_CLK,
#endif
#if     COM7_EN
    BSP_COM7_CLK,
#endif
#if     COM8_EN
    BSP_COM8_CLK,
#endif
};

static const uint32_t COM_TX_PORT_CLK[COMn] = {
#if     COM1_EN
    BSP_COM1_TX_GPIO_CLK,
#endif
#if     COM2_EN
    BSP_COM2_TX_GPIO_CLK,
#endif
#if     COM3_EN
    BSP_COM3_TX_GPIO_CLK,
#endif
#if     COM4_EN
    BSP_COM4_TX_GPIO_CLK,
#endif
#if     COM5_EN
    BSP_COM5_TX_GPIO_CLK,
#endif
#if     COM6_EN
    BSP_COM6_TX_GPIO_CLK,
#endif
#if     COM7_EN
    BSP_COM7_TX_GPIO_CLK,
#endif
#if     COM8_EN
    BSP_COM8_TX_GPIO_CLK,
#endif
};

static const uint32_t COM_RX_PORT_CLK[COMn] = {
#if     COM1_EN
    BSP_COM1_RX_GPIO_CLK,
#endif
#if     COM2_EN
    BSP_COM2_RX_GPIO_CLK,
#endif
#if     COM3_EN
    BSP_COM3_RX_GPIO_CLK,
#endif
#if     COM4_EN
    BSP_COM4_RX_GPIO_CLK,
#endif
#if     COM5_EN
    BSP_COM5_RX_GPIO_CLK,
#endif
#if     COM6_EN
    BSP_COM6_RX_GPIO_CLK,
#endif
#if     COM7_EN
    BSP_COM7_RX_GPIO_CLK,
#endif
#if     COM8_EN
    BSP_COM8_RX_GPIO_CLK,
#endif
};

static const uint16_t COM_TX_PIN[COMn] = {
#if     COM1_EN
    BSP_COM1_TX_PIN,
#endif
#if     COM2_EN
    BSP_COM2_TX_PIN,
#endif
#if     COM3_EN
    BSP_COM3_TX_PIN,
#endif
#if     COM4_EN
    BSP_COM4_TX_PIN,
#endif
#if     COM5_EN
    BSP_COM5_TX_PIN,
#endif
#if     COM6_EN
    BSP_COM6_TX_PIN,
#endif
#if     COM7_EN
    BSP_COM7_TX_PIN,
#endif
#if     COM8_EN
    BSP_COM8_TX_PIN,
#endif
};

static const uint16_t COM_RX_PIN[COMn] = {
#if     COM1_EN
    BSP_COM1_RX_PIN,
#endif
#if     COM2_EN
    BSP_COM2_RX_PIN,
#endif
#if     COM3_EN
    BSP_COM3_RX_PIN,
#endif
#if     COM4_EN
    BSP_COM4_RX_PIN,
#endif
#if     COM5_EN
    BSP_COM5_RX_PIN,
#endif
#if     COM6_EN
    BSP_COM6_RX_PIN,
#endif
#if     COM7_EN
    BSP_COM7_RX_PIN,
#endif
#if     COM8_EN
    BSP_COM8_RX_PIN,
#endif
};

