zhaozhi0810/stm32f407_embitz/ucos-20190121-lib/bsp/src/BSP_Uart.c
static const uint32_t COM_DMA_DR_BASE[COMn] = {
#if     COM1_EN
    BSP_COM1_DMA_DR_BASE,
#endif
#if     COM2_EN
    BSP_COM2_DMA_DR_BASE,
#endif
#if     COM3_EN
    BSP_COM3_DMA_DR_BASE,
#endif
#if     COM4_EN
    BSP_COM4_DMA_DR_BASE,
#endif
#if     COM5_EN
    BSP_COM5_DMA_DR_BASE,
#endif
#if     COM6_EN
    BSP_COM6_DMA_DR_BASE,
#endif
#if     COM7_EN
    BSP_COM7_DMA_DR_BASE,
#endif
#if     COM8_EN
    BSP_COM8_DMA_DR_BASE,
#endif
};

static const uint32_t COM_DMA_CLK[COMn] = {
#if     COM1_EN
    BSP_COM1_DMA_CLK,
#endif
#if     COM2_EN
    BSP_COM2_DMA_CLK,
#endif
#if     COM3_EN
    BSP_COM3_DMA_CLK,
#endif
#if     COM4_EN
    BSP_COM4_DMA_CLK,
#endif
#if     COM5_EN
    BSP_COM5_DMA_CLK,
#endif
#if     COM6_EN
    BSP_COM6_DMA_CLK,
#endif
#if     COM7_EN
    BSP_COM7_DMA_CLK,
#endif
#if     COM8_EN
    BSP_COM8_DMA_CLK,
#endif
};

static const uint32_t COM_DMA_TX_FLAG[COMn] = {
#if     COM1_EN
    BSP_COM1_Tx_DMA_FLAG,
#endif
#if     COM2_EN
    BSP_COM2_Tx_DMA_FLAG,
#endif
#if     COM3_EN
    BSP_COM3_Tx_DMA_FLAG,
#endif
#if     COM4_EN
    BSP_COM4_Tx_DMA_FLAG,
#endif
#if     COM5_EN
    BSP_COM5_Tx_DMA_FLAG,
#endif
#if     COM6_EN
    BSP_COM6_Tx_DMA_FLAG,
#endif
#if     COM7_EN
    BSP_COM7_Tx_DMA_FLAG,
#endif
#if     COM8_EN
    BSP_COM8_Tx_DMA_FLAG,
#endif
};

static const uint32_t COM_DMA_TX_CHANNEL[COMn] = {
#if     COM1_EN
    BSP_COM1_Tx_DMA_Channel,
#endif
#if     COM2_EN
    BSP_COM2_Tx_DMA_Channel,
#endif
#if     COM3_EN
    BSP_COM3_Tx_DMA_Channel,
#endif
#if     COM4_EN
    BSP_COM4_Tx_DMA_Channel,
#endif
#if     COM5_EN
    BSP_COM5_Tx_DMA_Channel,
#endif
#if     COM6_EN
    BSP_COM6_Tx_DMA_Channel,
#endif
#if     COM7_EN
    BSP_COM7_Tx_DMA_Channel,
#endif
#if     COM8_EN
    BSP_COM8_Tx_DMA_Channel,
#endif
};

static DMA_Stream_TypeDef * const COM_DMA_TX_STREAM[COMn] = {
#if     COM1_EN
    BSP_COM1_Tx_DMA_Stream,
#endif
#if     COM2_EN
    BSP_COM2_Tx_DMA_Stream,
#endif
#if     COM3_EN
    BSP_COM3_Tx_DMA_Stream,
#endif
#if     COM4_EN
    BSP_COM4_Tx_DMA_Stream,
#endif
#if     COM5_EN
    BSP_COM5_Tx_DMA_Stream,
#endif
#if     COM6_EN
    BSP_COM6_Tx_DMA_Stream,
#endif
#if     COM7_EN
    BSP_COM7_Tx_DMA_Stream,
#endif
#if     COM8_EN
    BSP_COM8_Tx_DMA_Stream,
#endif
};


static const uint32_t COM_RX_IRQn[COMn] = {
#if     COM1_EN
    BSP_COM1_IRQn,
#endif
#if     COM2_EN
    BSP_COM2_IRQn,
#endif
#if     COM3_EN
    BSP_COM3_IRQn,
#endif
#if     COM4_EN
    BSP_COM4_IRQn,
#endif
#if     COM5_EN
    BSP_COM5_IRQn,
#endif
#if     COM6_EN
    BSP_COM6_IRQn,
#endif
#if     COM7_EN
    BSP_COM7_IRQn,
#endif
#if     COM8_EN
    BSP_COM8_IRQn,
#endif
};

static uint8_t * const COM_TX_BUFF[COMn] = {
#if     COM1_EN
    COM1_TX_BUFF,
#endif
#if     COM2_EN
    COM2_TX_BUFF,
#endif
#if     COM3_EN
    COM3_TX_BUFF,
#endif
#if     COM4_EN
    COM4_TX_BUFF,
#endif
#if     COM5_EN
    COM5_TX_BUFF,
#endif
#if     COM6_EN
    COM6_TX_BUFF,
#endif
#if     COM7_EN
    COM7_TX_BUFF,
#endif
#if     COM8_EN
    COM8_TX_BUFF,
#endif
};

static const uint32_t COM_TX_BUFF_SIZE[COMn] = {
#if     COM1_EN
    BSP_COM1_Tx_BUFF_SIZE,
#endif
#if     COM2_EN
    BSP_COM2_Tx_BUFF_SIZE,
#endif
#if     COM3_EN
    BSP_COM3_Tx_BUFF_SIZE,
#endif
#if     COM4_EN
    BSP_COM4_Tx_BUFF_SIZE,
#endif
#if     COM5_EN
    BSP_COM5_Tx_BUFF_SIZE,
#endif
#if     COM6_EN
    BSP_COM6_Tx_BUFF_SIZE,
#endif
#if     COM7_EN
    BSP_COM7_Tx_BUFF_SIZE,
#endif
#if     COM8_EN
    BSP_COM8_Tx_BUFF_SIZE,
#endif
};

static uint8_t * const COM_RX_BUFF[COMn] = {
#if     COM1_EN
    COM1_RX_BUFF,
#endif
#if     COM2_EN
    COM2_RX_BUFF,
#endif
#if     COM3_EN
    COM3_RX_BUFF,
#endif
#if     COM4_EN
    COM4_RX_BUFF,
#endif
#if     COM5_EN
    COM5_RX_BUFF,
#endif
#if     COM6_EN
    COM6_RX_BUFF,
#endif
#if     COM7_EN
    COM7_RX_BUFF,
#endif
#if     COM8_EN
    COM8_RX_BUFF,
#endif
};

static const uint32_t COM_RX_BUFF_SIZE[COMn] = {
#if     COM1_EN
    BSP_COM1_Rx_BUFF_SIZE,
#endif
#if     COM2_EN
    BSP_COM2_Rx_BUFF_SIZE,
#endif
#if     COM3_EN
    BSP_COM3_Rx_BUFF_SIZE,
#endif
#if     COM4_EN
    BSP_COM4_Rx_BUFF_SIZE,
#endif
#if     COM5_EN
    BSP_COM5_Rx_BUFF_SIZE,
#endif
#if     COM6_EN
    BSP_COM6_Rx_BUFF_SIZE,
#endif
#if     COM7_EN
    BSP_COM7_Rx_BUFF_SIZE,
#endif
#if     COM8_EN
    BSP_COM8_Rx_BUFF_SIZE,
#endif
};

static QUEUE8_TYPE * const COM_RX_QUEUE[COMn] = {
#if     COM1_EN
    &COM1_RX_QUEUE,
#endif
#if     COM2_EN
    &COM2_RX_QUEUE,
#endif
#if     COM3_EN
    &COM3_RX_QUEUE,
#endif
#if     COM4_EN
    &COM4_RX_QUEUE,
#endif
#if     COM5_EN
    &COM5_RX_QUEUE,
#endif
#if     COM6_EN
    &COM6_RX_QUEUE,
#endif
#if     COM7_EN
    &COM7_RX_QUEUE,
#endif
#if     COM8_EN
    &COM8_RX_QUEUE,
#endif
};

static const uint16_t parityArr[3] = {USART_Parity_No, USART_Parity_Odd, USART_Parity_Even};

/*******************************************************************************
* Function Name :BSP_Uart1Open
* Description   :串口及引脚初始化
* Input         :   uartx: COM1,COM2,COM3....
                    baud: 2400，4800，9600，19200，38400，57600，115200
                    data: 数据位数  8,9,
                    stop：停止位数  1,2
                    parity:效验    0: 无效验，1：奇效验，2:偶效验
* Output        :
* Other         :
* Date          :2013.08.12
*******************************************************************************/
void BSP_UartOpen(uint8_t COM,  uint32_t baud, uint8_t data, uint8_t stop, uint8_t parity)
{
    USART_InitTypeDef USART_InitStructure;
    GPIO_InitTypeDef GPIO_InitStructure;
    NVIC_InitTypeDef NvicInitdef;
    DMA_InitTypeDef DMA_InitStructure;

    /* DMA clock enable */
    RCC_AHB1PeriphClockCmd(COM_DMA_CLK[COM], ENABLE);   //DMA时钟使能

    /* Enable GPIO clock */
    RCC_AHB1PeriphClockCmd(COM_TX_PORT_CLK[COM] | COM_RX_PORT_CLK[COM], ENABLE);    //UART对应的GPIO时钟使能

    /* Enable UART clock */
    if ((COM_USART[COM] == USART1) || (COM_USART[COM] == USART6))     //UART模块时钟使能
    {
        RCC_APB2PeriphClockCmd(COM_USART_CLK[COM], ENABLE);
    }
    else
    {
        RCC_APB1PeriphClockCmd(COM_USART_CLK[COM], ENABLE);
    }
    USART_DeInit(COM_USART[COM]);     //去除uart的初始化设置，为后面的设置做准备

    /* Connect PXx to USARTx_Tx*/
    GPIO_PinAFConfig(COM_TX_PORT[COM], COM_TX_AF_PIN[COM], COM_AF[COM]);     //配置GPIO为功能引脚
    /* Connect PXx to USARTx_Rx*/
    GPIO_PinAFConfig(COM_RX_PORT[COM], COM_RX_AF_PIN[COM], COM_AF[COM]);    //配置GPIO为功能引脚

