zhaozhi0810/stm32f407_embitz/ucos-20190121-lib/bsp/src/BSP_Uart.c
    /* Configure USART Tx as alternate function push-pull */
    GPIO_InitStructure.GPIO_Pin = COM_TX_PIN[COM];
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_Init(COM_TX_PORT[COM], &GPIO_InitStructure);            //GPIO  TX初始化

    /* Configure USART Rx as input floating */
    GPIO_InitStructure.GPIO_Pin = COM_RX_PIN[COM];
    GPIO_Init(COM_RX_PORT[COM], &GPIO_InitStructure);        //GPIO  RX初始化

    /* USART configuration */
    USART_StructInit(&USART_InitStructure);
    USART_InitStructure.USART_BaudRate = baud;
    USART_InitStructure.USART_StopBits = (stop == 2)? USART_StopBits_2 : USART_StopBits_1;
    USART_InitStructure.USART_WordLength = (data == 9)? USART_WordLength_9b : USART_WordLength_8b;
    USART_InitStructure.USART_Parity = (parity < 3)? parityArr[parity] : USART_Parity_No;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    USART_Init(COM_USART[COM], &USART_InitStructure);              //串口的初始化，包括波特率，停止位，数据位，奇偶校验等

    /* Enable USART DMA_TX*/
    USART_DMACmd(COM_USART[COM], USART_DMAReq_Tx, ENABLE);      //DMA方式使能，发送DMA

    USART_ITConfig(COM_USART[COM], USART_IT_RXNE, ENABLE);            //接收中断使能，接收到数据就会中断

     /* Enable USART */
    USART_Cmd(COM_USART[COM], ENABLE);   //开启串口

    NvicInitdef.NVIC_IRQChannel = COM_RX_IRQn[COM];
    NvicInitdef.NVIC_IRQChannelPreemptionPriority = 3;
    NvicInitdef.NVIC_IRQChannelSubPriority = 0;
    NvicInitdef.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init( &NvicInitdef );                          //配置中断

    QUEUE_PacketCreate(COM_RX_QUEUE[COM], COM_RX_BUFF[COM], COM_RX_BUFF_SIZE[COM]);   //初始化接收缓存队列
    QUEUE_PacketCreate(&TX_QUEUE, TX_BUFF, BSP_COM1_Tx_BUFF_SIZE);   //初始化发送缓存队列
    /* -------------------------------DMA发送------------------------------  */
    /* DMA StreamX Config */
    DMA_DeInit(COM_DMA_TX_STREAM[COM]);       //DMA去除设置

    /* DMA StreamX disable */
    DMA_Cmd(COM_DMA_TX_STREAM[COM], DISABLE);    //DMA禁止发送

    DMA_StructInit(&DMA_InitStructure);
    DMA_InitStructure.DMA_Channel = COM_DMA_TX_CHANNEL[COM];                 //DMA通道设置
    DMA_InitStructure.DMA_PeripheralBaseAddr = (u32)COM_DMA_DR_BASE[COM];    //DMA外部设备的地址
    DMA_InitStructure.DMA_Memory0BaseAddr = (u32)COM_TX_BUFF[COM];              //DMA内存地址
    DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;                              //DMA的方向是从内存到外设
    DMA_InitStructure.DMA_BufferSize = 0;                                                                   //DMA的缓存字节为0，没有数据需要发送
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;                     //外设地址不递增
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;                             //内存地址递增
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;         //外设数据宽度 字节宽度
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;              //内存数据宽度，字节宽度
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;                                       // 正常模式，即满了就不在接收了，而不是循环存储
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;                                         //DMA优先级高
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;                           //FIFO打开
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;                   //FIFO门槛，满
    DMA_Init(COM_DMA_TX_STREAM[COM], &DMA_InitStructure);

    DMA_FlowControllerConfig(COM_DMA_TX_STREAM[COM], DMA_FlowCtrl_Memory);    //控制流 取决于内存缓存
}


/*******************************************************************************
* Function Name : void BSP_UartClose(uint8_t COMx)
* Description   : 串口关闭
* Input         : COMx:通道x
* Output        :
* Other         :
* Date          : 2013.08.12
*******************************************************************************/
void BSP_UartClose(uint8_t COM)
{
    if ((COM_USART[COM] == USART1) || (COM_USART[COM] == USART6))
    {
        RCC_APB2PeriphClockCmd(COM_USART_CLK[COM], DISABLE);
    }
    else
    {
        RCC_APB1PeriphClockCmd(COM_USART_CLK[COM], DISABLE);
    }

    RCC_AHB1PeriphClockCmd(COM_DMA_CLK[COM], ENABLE);
    DMA_Cmd(COM_DMA_TX_STREAM[COM], DISABLE);
    USART_DMACmd(COM_USART[COM], USART_DMAReq_Tx, DISABLE);
    USART_ITConfig(COM_USART[COM], USART_IT_RXNE, DISABLE);
    USART_Cmd(COM_USART[COM], DISABLE);
}

/*******************************************************************************
* Function Name : uint32_t BSP_UartWrite(uint8_t COMx, uint8_t *buffter, uint32_t len)
* Description   : 串口发送数据
* Input         :   COMx:通道x
* Output        :
* Other         :
* Date          : 2013.08.12
*******************************************************************************/
uint32_t BSP_UartWrite(uint8_t COM, uint8_t *buffter, uint32_t len)
{
    if (COM >= COMn)
        return 0;

    if (0 == len)
        return 0;

    if ((DMA_GetCurrDataCounter(COM_DMA_TX_STREAM[COM]) == 0)
        && (DMA_FIFOStatus_Empty == DMA_GetFIFOStatus(COM_DMA_TX_STREAM[COM])))
    {
        uint32_t resLen = 0;

        USART_ClearFlag(COM_USART[COM], USART_FLAG_TC);
        resLen = (COM_TX_BUFF_SIZE[COM] > len)? len : COM_TX_BUFF_SIZE[COM];
        memcpy((void *)(COM_TX_BUFF[COM]), buffter, resLen);
        DMA_Cmd(COM_DMA_TX_STREAM[COM], DISABLE);
        DMA_ClearFlag(COM_DMA_TX_STREAM[COM], COM_DMA_TX_FLAG[COM]);
        DMA_SetCurrDataCounter(COM_DMA_TX_STREAM[COM], resLen);
        DMA_Cmd(COM_DMA_TX_STREAM[COM], ENABLE);

        return resLen;
    }
    return 0;
}

/*******************************************************************************
* Function Name : uint32_t BSP_UartRead(uint8_t COMx, uint8_t *buffter, uint32_t len)
* Description   : 串口读回数据
* Input         : COMx:通道x
* Output        :
* Other         :
* Date          : 2013.08.12
*******************************************************************************/
uint32_t BSP_UartRead(uint8_t COM, uint8_t *buffter, uint32_t len)
{
    return QUEUE_PacketOut(COM_RX_QUEUE[COM], buffter, len);
}

