zhaozhi0810/stm32f407_embitz/ucos-20190121-lib/bsp/src/BSP_Uart.c
/*******************************************************************************
* Function Name : uint32_t BSP_UartTxIdleState(uint8_t COM)
* Description   : 查询 发送是否 发送完成
* Input         :
* Output        :       1)忙碌      0)空闲
* Other         :
* Date          : 2013.08.12
*******************************************************************************/
uint32_t BSP_UartTxIdleState(uint8_t COM)
{
    return (DMA_GetCurrDataCounter(COM_DMA_TX_STREAM[COM])
            || (USART_GetFlagStatus(COM_USART[COM], USART_FLAG_TC) != SET));
}


/*******************************************************************************
* Function Name : void _IRQHandler(uint8_t COM)
* Description   : 中断函数
* Input         :
* Output        :
* Other         :
* Date          : 2013.08.12
*******************************************************************************/
void _IRQHandler(uint8_t COM)
{
    if (USART_GetITStatus(COM_USART[COM], USART_IT_RXNE) != RESET)
    {
        u8 ch = USART_ReceiveData(COM_USART[COM]);  //读数据后 会自动清空标志
        QUEUE_PacketIn(COM_RX_QUEUE[COM], &ch, 1);
//        BSP_UartWrite(COM, &ch, 1);  //数据回显
        USART_SendData(COM_USART[COM], ch);  //数据回显
    }
}

#if COM1_EN > 0
/*******************************************************************************
* Function Name  : USART1_IRQHandler
* Description    : This function handles USART1 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART1_IRQHandler(void)
{
    _IRQHandler(COM1);
}
#endif //COM1_EN > 0

#if COM2_EN > 0
/*******************************************************************************
* Function Name  : USART2_IRQHandler
* Description    : This function handles USART2 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART2_IRQHandler(void)
{
    _IRQHandler(COM2);
}
#endif //COM2_EN > 0

#if COM3_EN > 0
/*******************************************************************************
* Function Name  : USART3_IRQHandler
* Description    : This function handles USART3 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART3_IRQHandler(void)
{
    _IRQHandler(COM3);
}
#endif //COM3_EN > 0

#if COM4_EN > 0
/*******************************************************************************
* Function Name  : USART4_IRQHandler
* Description    : This function handles USART4 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void UART4_IRQHandler(void)
{
    _IRQHandler(COM4);
}
#endif //COM4_EN > 0

#if COM5_EN > 0
/*******************************************************************************
* Function Name  : USART5_IRQHandler
* Description    : This function handles USART5 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void UART5_IRQHandler(void)
{
    _IRQHandler(COM5);
}
#endif //COM5_EN > 0

#if COM6_EN > 0
/*******************************************************************************
* Function Name  : USART6_IRQHandler
* Description    : This function handles USART6 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART6_IRQHandler(void)
{
    _IRQHandler(COM6);
}
#endif //COM6_EN > 0

#if COM7_EN > 0
/*******************************************************************************
* Function Name  : USART7_IRQHandler
* Description    : This function handles USART7 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void UART7_IRQHandler(void)
{
    _IRQHandler(COM7);
}
#endif //COM7_EN > 0

#if COM8_EN > 0
/*******************************************************************************
* Function Name  : USART8_IRQHandler
* Description    : This function handles USART8 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void UART8_IRQHandler(void)
{
    _IRQHandler(COM8);
}
#endif //COM8_EN > 0

//BSP_Uart.c







//串口输出函数接口
//20190121 zhaozhi 增加
int _write (int fd, char *pBuffer, int size)
{
//    BSP_UartWrite(COM1,pBuffer,size);
    QUEUE_PacketIn(&TX_QUEUE,pBuffer,size);  //将要打印的数据存放到队列中
    return size;
}



void send_uart1(void)
{
    int len = 1;
    if(TX_QUEUE.pStart != TX_QUEUE.pEnd)       //如果发送队列中有数据，就准备发送
    {
          if ((DMA_GetCurrDataCounter(COM_DMA_TX_STREAM[COM1]) == 0)
        && (DMA_FIFOStatus_Empty == DMA_GetFIFOStatus(COM_DMA_TX_STREAM[COM1])))  //检查是不是有数据正在发送
        {
            uint32_t resLen = 0;

            USART_ClearFlag(COM_USART[COM1], USART_FLAG_TC);
 //           resLen = (COM_TX_BUFF_SIZE[COM1] > len)? len : COM_TX_BUFF_SIZE[COM1];
//            memcpy((void *)(COM_TX_BUFF[COM]), buffter, resLen);
            len = QUEUE_PacketOut(&TX_QUEUE,COM_TX_BUFF[COM1],1024);   //将发送的数据移出队列发送出去，返回值是从队列中读取的数据
            DMA_Cmd(COM_DMA_TX_STREAM[COM1], DISABLE);
            DMA_ClearFlag(COM_DMA_TX_STREAM[COM1], COM_DMA_TX_FLAG[COM1]);
            DMA_SetCurrDataCounter(COM_DMA_TX_STREAM[COM1], len);    //准备发送的数据
            DMA_Cmd(COM_DMA_TX_STREAM[COM1], ENABLE);                     //开始DMA发送数据

 //           return ;
        }
    }
}




int uart1_read (char *pBuffer, int size)
{
    int ret ;
    if((ret = QUEUE_PacketDoubleCharSplit(COM_RX_QUEUE[COM1],'\n','\r',pBuffer,size)) != 0)
    {
        return ret;
    }
    else if((ret = QUEUE_PacketDoubleCharSplit(COM_RX_QUEUE[COM1],'\r','\n',pBuffer,size)) != 0)
    {
        return ret;
    }
    else if((ret = QUEUE_PacketCharSplit(COM_RX_QUEUE[COM1],'\r',pBuffer,size))!= 0)
    {
        return ret;
    }
    else if((ret = QUEUE_PacketCharSplit(COM_RX_QUEUE[COM1],'\n',pBuffer,size))!= 0)
    {
        return ret;
    }
    return 0;
}




